tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
# Shell plugin manager
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Platform built on V8 to build network applications
brew "node"
# Contentful command-line tools
brew "contentful-cli"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Programming language for highly scalable real-time systems
brew "erlang"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# GNU multiple precision arithmetic library
brew "gmp"
# Generic library support script
brew "libtool"
# Manage compile and link flags for libraries
brew "pkg-config"
# Library for command-line editing
brew "readline"
# GNU Emacs text editor
brew "emacs", restart_service: true
# Modern replacement for 'ls'
brew "exa"
# Command-line tool to interact with exercism.io
brew "exercism"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Command-line interface for SQLite
brew "sqlite"
# Core application library for C
brew "glib"
# X.509 and CMS library
brew "libksba"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Network authentication protocol
brew "krb5"
# XML security library
brew "libxmlsec1"
# YAML Parser
brew "libyaml"
# Mac App Store command-line interface
brew "mas"
# Platform built on V8 to build network applications
brew "node@10"
# Object-relational database system
brew "postgresql", restart_service: true
# Object-relational database system
brew "postgresql@9.5"
# Python version management
brew "pyenv"
# JavaScript package manager
brew "yarn"
# Tracks most-used directories to make cd smarter
brew "z"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Web browser focusing on privacy
cask "brave-browser"
cask "emacs"
# Finder toolbar app to open current folder in Visual Studio Code
cask "open-in-code"
# Spotify and iTunes in the menu bar
cask "spotmenu"
# Break time reminder app
cask "stretchly"
mas "AdBlock Max", id: 1484776532
mas "Amphetamine", id: 937984704
mas "ColorSlurp", id: 1287239339
mas "Day One", id: 1055511498
mas "Display Menu", id: 549083868
mas "Forecast Bar", id: 982710545
mas "GarageBand", id: 682658836
mas "Gifski", id: 1351639930
mas "Grammarly for Safari", id: 1462114288
mas "HazeOver", id: 430798174
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Messenger", id: 1480068668
mas "Mobile Mouse Server", id: 412814284
mas "Numbers", id: 409203825
mas "Octotree", id: 1457450145
mas "Pages", id: 409201541
mas "Pixelmator", id: 407963104
mas "Slack", id: 803453959
mas "Spark", id: 1176895641
mas "Tab Suspender", id: 1495356253
mas "The Ebook Converter", id: 1081457679
mas "The Unarchiver", id: 425424353
mas "WhatsOn", id: 1136082516
mas "Xcode", id: 497799835
